src/cfe/InformationRegisters/http_ЖурналВходящихЗапросов.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>http_ЖурналВходящихЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.http_HTTPМетоды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Resource>
				<Properties>
					<Name>ХешЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/http_РегламентныеЗадания/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// http_РегламентныеЗадания
//
// Обработчики регламентных заданий:
//   * РазблокироватьКонфликты - помечает зависшие запросы как истёкшие.
//   * СократитьЖурналы        - удаляет устаревшие записи журналов.
//
// Запуск контролируется константой http_ИспользоватьРегламентныеЗадания.
// Если константа = Ложь, обработчики сразу выходят без работы.
///////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Помечает зависшие запросы (КодСостояния = 0) старше таймаута как 408 Request
// Timeout. После этого их Idempotency-Key освобождается для повторных запросов.
//
// Таймаут считается от ВремениНачала записи (универсальное время в мс).
// По умолчанию - 5 минут.
//
Процедура РазблокироватьКонфликты() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Не Константы.http_ИспользоватьРегламентныеЗадания.Получить() Тогда
		Возврат;
	КонецЕсли;

	ТаймаутМс = ТаймаутРазблокировкиМс();
	ГраницаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ТаймаутМс;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Журнал.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.http_ЖурналВходящихЗапросов КАК Журнал
		|ГДЕ
		|	Журнал.КодСостояния = 0
		|	И Журнал.ВремяНачала < &ГраницаВремени");
	Запрос.УстановитьПараметр("ГраницаВремени", ГраницаВремени);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ОтметитьЗаписьКакИстёкшую(Выборка.Идентификатор);
	КонецЦикла;

КонецПроцедуры

// Удаляет записи журнала старше N дней (N задаётся в константе или дефолт 30).
Процедура СократитьЖурналы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Не Константы.http_ИспользоватьРегламентныеЗадания.Получить() Тогда
		Возврат;
	КонецЕсли;

	ДнейХраненияПоУмолчанию = 30;
	ДатаГраница = НачалоДня(ТекущаяДатаСеанса()) - ДнейХраненияПоУмолчанию * 86400;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Журнал.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.http_ЖурналВходящихЗапросов КАК Журнал
		|ГДЕ
		|	Журнал.ДатаЗапроса < &ДатаГраница");
	Запрос.УстановитьПараметр("ДатаГраница", ДатаГраница);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		УдалитьЗаписьЖурнала(Выборка.Идентификатор);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаймаутРазблокировкиМс()

	// 5 минут. Прикладной код может переопределить через свой обработчик регламентного задания
	Возврат 5 * 60 * 1000;

КонецФункции

Процедура ОтметитьЗаписьКакИстёкшую(Идентификатор)

	НаборЗаписей = РегистрыСведений.http_ЖурналВходящихЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КодСостояния = 408;
		Запись.Ответ        = "{""code"":408,""error"":""Request timeout (released by scheduled job)""}";
	КонецЦикла;
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура УдалитьЗаписьЖурнала(Идентификатор)

	НаборЗаписей = РегистрыСведений.http_ЖурналВходящихЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Записать(); // пустой набор - удаляет запись

КонецПроцедуры

#КонецОбласти
